wiki.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2020-09-23 三 11:08 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>&lrm;</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Evan Meek">
<link rel="shortcut icon" href="/images/rose-red.png" type="image/x-icon" />
<link rel="stylesheet" href="/css/animate.min.css" />
<link rel="stylesheet" href="/css/all.min.css" />
<link rel="stylesheet" type="text/css" href="/css/style.css" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org6120c9a">WIKI</a>
<ul>
<li><a href="#orga0fa6ff">ivy-dired下重命名确认 <span class="timestamp-wrapper"><span class="timestamp">&lt;2020-05-15 五&gt;</span></span>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="emacs">emacs</span>&#xa0;<span class="ivy">ivy</span>&#xa0;<span class="dired">dired</span></span></a></li>
<li><a href="#org78d3423">Linux下调节屏幕亮度 <span class="timestamp-wrapper"><span class="timestamp">&lt;2020-09-19 六&gt;</span></span>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="linux">linux</span></span></a>
<ul>
<li><a href="#org32a3872">查看亮度是由谁控制的</a></li>
<li><a href="#org050d36a">查看最大亮度</a></li>
<li><a href="#org72184ff">设置当前亮度</a></li>
<li><a href="#org1eda128">可能会遇到的问题</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org6120c9a" class="outline-2">
<h2 id="org6120c9a">WIKI</h2>
<div class="outline-text-2" id="text-org6120c9a">
<blockquote>
<p>
只要我记录的够多，这里就能成为百科全书。
</p>
</blockquote>
</div>

<div id="outline-container-orga0fa6ff" class="outline-3">
<h3 id="orga0fa6ff">ivy-dired下重命名确认 <span class="timestamp-wrapper"><span class="timestamp">&lt;2020-05-15 五&gt;</span></span>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="emacs">emacs</span>&#xa0;<span class="ivy">ivy</span>&#xa0;<span class="dired">dired</span></span></h3>
<div class="outline-text-3" id="text-orga0fa6ff">
<p>
在我使用 <code>(dired-do-rename)</code> 时发现如果重命名时新名称跟旧名称相似，直接按回车是无法修改的，因为ivy会自动将旧名称补全为新名称，等于没有修改，所以我们在重命名时，输入新名称后，可以调用命令 <code>(ivy-immediate-done)</code> 默认快捷键是<sub>C</sub>-M-j_，这样就可以直接确认，ivy也不会将旧名称补全给新名称。
</p>
</div>
</div>
<div id="outline-container-org78d3423" class="outline-3">
<h3 id="org78d3423">Linux下调节屏幕亮度 <span class="timestamp-wrapper"><span class="timestamp">&lt;2020-09-19 六&gt;</span></span>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="linux">linux</span></span></h3>
<div class="outline-text-3" id="text-org78d3423">
</div>
<div id="outline-container-org32a3872" class="outline-4">
<h4 id="org32a3872">查看亮度是由谁控制的</h4>
<div class="outline-text-4" id="text-org32a3872">
<div class="org-src-container">
<pre class="src src-shell">ls /sys/class/backlight/
</pre>
</div>
</div>
</div>
<div id="outline-container-org050d36a" class="outline-4">
<h4 id="org050d36a">查看最大亮度</h4>
<div class="outline-text-4" id="text-org050d36a">
<div class="org-src-container">
<pre class="src src-shell">cat /sys/class/backlight/intel_backlight/max_brightness
</pre>
</div>
</div>
</div>
<div id="outline-container-org72184ff" class="outline-4">
<h4 id="org72184ff">设置当前亮度</h4>
<div class="outline-text-4" id="text-org72184ff">
<div class="org-src-container">
<pre class="src src-shell">cat /sys/class/backlight/intel_backlight/max_brightness &gt; /sys/class/backlight/intel_backlight/brightness 
</pre>
</div>
</div>
</div>

<div id="outline-container-org1eda128" class="outline-4">
<h4 id="org1eda128">可能会遇到的问题</h4>
<div class="outline-text-4" id="text-org1eda128">
<p>
设置亮度可能会出现权限问题，那么可以这样设置:
</p>
<div class="org-src-container">
<pre class="src src-shell">sudo chmod 777 /sys/class/backlight/intel_backlight/brightness
</pre>
</div>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2020-07-14 二 00:00</p>
<p class="author">Author: Evan Meek</p>
<p class="date">Created: 2020-09-23 三 11:08</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
